Note/IOMonadInJavaScript.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-23 周日 18:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IO monad in JavaScript</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">IO monad in JavaScript</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6895e7c">1. Monad in Haskell</a></li>
<li><a href="#org68ea41b">2. Simulating IO monad in JavaScript</a>
<ul>
<li><a href="#org9da4f86">2.1. Simple examples</a></li>
</ul>
</li>
<li><a href="#orgb94af55">3. Examples with DOM</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6895e7c" class="outline-2">
<h2 id="org6895e7c"><span class="section-number-2">1</span> Monad in Haskell</h2>
<div class="outline-text-2" id="text-1">
<p>
Monad is quite interesting and important for Haskell and that's why
<i>Haskell</i> chooses <code>&gt;\lambda</code> for their logo.
</p>

<ul class="org-ul">
<li>Monad definition</li>
</ul>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #729fcf; font-weight: bold;">class</span> <span style="color: #8ae234; font-weight: bold;">Applicative</span> m <span style="color: #ff6347; font-weight: bold;">=&gt;</span> <span style="color: #8ae234; font-weight: bold;">Monad</span> m <span style="color: #729fcf; font-weight: bold;">where</span>
  return <span style="color: #ff6347; font-weight: bold;">::</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> m a
  <span style="color: #ffd700;">(</span><span style="color: #ff6347; font-weight: bold;">&gt;&gt;=</span><span style="color: #ffd700;">)</span>  <span style="color: #ff6347; font-weight: bold;">::</span> m a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #ffd700;">(</span>a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> m b<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">-&gt;</span> m b
  <span style="color: #ffd700;">(</span><span style="color: #ff6347; font-weight: bold;">&gt;&gt;</span><span style="color: #ffd700;">)</span>   <span style="color: #ff6347; font-weight: bold;">::</span> m a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> m b <span style="color: #ff6347; font-weight: bold;">-&gt;</span> m b
  m <span style="color: #ff6347; font-weight: bold;">&gt;&gt;</span> n <span style="color: #ff6347; font-weight: bold;">=</span> m <span style="color: #ff6347; font-weight: bold;">&gt;&gt;</span> <span style="color: #ff6347; font-weight: bold;">\</span><span style="color: #729fcf; font-weight: bold;">_</span> <span style="color: #ff6347; font-weight: bold;">-&gt;</span> n
</pre>
</div>
<ul class="org-ul">
<li>Note: (&gt;&gt;=) sometimes can be also called <code>bind</code>.</li>
</ul>
</div>
</div>


<div id="outline-container-org68ea41b" class="outline-2">
<h2 id="org68ea41b"><span class="section-number-2">2</span> Simulating IO monad in JavaScript</h2>
<div class="outline-text-2" id="text-2">
<p>
All we need to do is to wrap side-effects into IO monad.
</p>
<div class="org-src-container">
<pre class="src src-javascript">
<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">IO :: (() -&gt; a) -&gt; IO a</span>
<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">IO</span> = f =&gt; <span style="color: #ffd700;">(</span><span style="color: #00bfff;">{</span>
    <span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">runIO :: () -&gt; IO a</span>
    runIO: f,
    
    <span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">map :: (a -&gt; b) -&gt; IO b</span>
    map: g =&gt; IO<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">()</span> =&gt; g<span style="color: #ff7f50;">(</span>f<span style="color: #00ff00;">()</span><span style="color: #ff7f50;">)</span><span style="color: #ffa500;">)</span>,
    
    <span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">then :: (a -&gt; IO b) -&gt; IO b</span>
    then: g =&gt; g<span style="color: #ffa500;">(</span>f<span style="color: #ff7f50;">()</span><span style="color: #ffa500;">)</span>
<span style="color: #00bfff;">}</span><span style="color: #ffd700;">)</span>;

<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">IO.of :: a -&gt; IO a</span>
IO.of = x =&gt; IO<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; x<span style="color: #ffd700;">)</span>;

</pre>
</div>
<p>
where <code>of</code> is for <code>return</code> and <code>then</code> is for <code>bind</code>.
</p>
</div>

<div id="outline-container-org9da4f86" class="outline-3">
<h3 id="org9da4f86"><span class="section-number-3">2.1</span> Simple examples</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-javascript">
<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">log :: String -&gt; a -&gt; IO a</span>
<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">log</span> = label =&gt; x =&gt;
      IO<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; <span style="color: #00bfff;">(</span>console.log<span style="color: #ffa500;">(</span>label, x<span style="color: #ffa500;">)</span>, x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>;

<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">jump :: a -&gt; IO a</span>
<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">alarm</span> = x =&gt;
      IO<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; <span style="color: #00bfff;">(</span>alert<span style="color: #ffa500;">(</span>x<span style="color: #ffa500;">)</span>, x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>;

</pre>
</div>

<p>
Then we can try our IO monad:
</p>
<div class="org-src-container">
<pre class="src src-javascript">
<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">test :: String -&gt; IO String</span>
<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">test</span> = s =&gt;
  IO.of<span style="color: #ffd700;">(</span>s<span style="color: #ffd700;">)</span>
    .then<span style="color: #ffd700;">(</span>log<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">'Before:'</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
    .map<span style="color: #ffd700;">(</span>s =&gt; s.toUpperCase<span style="color: #00bfff;">()</span><span style="color: #ffd700;">)</span>
    .then<span style="color: #ffd700;">(</span>log<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">'Now:'</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>;

test<span style="color: #ffd700;">(</span><span style="color: #ad7fa8; font-style: italic;">'testing'</span><span style="color: #ffd700;">)</span>.runIO<span style="color: #ffd700;">()</span>;
</pre>
</div>
<p>
We can now combine sevel IO functions quite conveniently!
</p>
</div>
</div>
</div>


<div id="outline-container-orgb94af55" class="outline-2">
<h2 id="orgb94af55"><span class="section-number-2">3</span> Examples with DOM</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Some useful functions</li>
</ul>
<div class="org-src-container">
<pre class="src src-javascript">
<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">$ :: String -&gt; IO HTMLElement</span>
<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">$</span> = x =&gt;
      IO<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; document.querySelector<span style="color: #00bfff;">(</span>x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>;

<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">$id</span> = id =&gt;
      IO<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; document.getElementById<span style="color: #00bfff;">(</span>id<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>;

<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">$tag</span> = tag =&gt;
      IO<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; document.getElementsByTagName<span style="color: #00bfff;">(</span>tag<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>;

<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">$class</span> = node =&gt; c =&gt;
      IO<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; document.getElementsByClassName<span style="color: #00bfff;">(</span>node, c<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>;

<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">setAttr :: a -&gt; IO ()</span>
<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">setAttr</span> = attr =&gt; x =&gt; o =&gt;
      IO<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; o.setAttribute<span style="color: #00bfff;">(</span>attr, x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>;

<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">setText :: String -&gt; IO ()</span>
<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">setText</span> = x =&gt; o =&gt;
      IO<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; <span style="color: #00bfff;">{</span>o.textContent = x;<span style="color: #00bfff;">}</span><span style="color: #ffd700;">)</span>;

<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">getText :: HTMLElement -&gt; String</span>
<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">getText</span> = e =&gt; e.textContent;

</pre>
</div>

<ul class="org-ul">
<li>Let's try it!</li>
</ul>
<div class="org-src-container">
<pre class="src src-javascript">
<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">showImage :: Image -&gt; IO ()</span>
<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347; font-weight: bold;">showImage</span> = img =&gt;
    $id<span style="color: #ffd700;">(</span><span style="color: #ad7fa8; font-style: italic;">'placeholder'</span><span style="color: #ffd700;">)</span>
      .then<span style="color: #ffd700;">(</span>setAttr<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">'src'</span><span style="color: #00bfff;">)(</span>img.getAttribute<span style="color: #ffa500;">(</span><span style="color: #ad7fa8; font-style: italic;">'href'</span><span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
      .then<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; IO.of<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">'Next'</span><span style="color: #00bfff;">)</span>.then<span style="color: #00bfff;">(</span>log<span style="color: #ffa500;">(</span><span style="color: #ad7fa8; font-style: italic;">''</span><span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
      .then<span style="color: #ffd700;">(</span><span style="color: #00bfff;">()</span> =&gt; $id<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">'description'</span><span style="color: #00bfff;">)</span>.then<span style="color: #00bfff;">(</span>setText<span style="color: #ffa500;">(</span>img.textContent<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-01-27 周一 00:00</p>
<p class="author">Author: Comcx</p>
<p class="date">Created: 2020-02-23 周日 18:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
